# Vorlesung Pandas

## Konstruktor

In [1]:
import pandas as pd

In [20]:
data= {
    "matnr": [333, 444, 555, 1234],
    "name": ['hugo','bernd','Bob','Alice'],
    "alter": [16, 21, 45, 26]
}

In [21]:
df = pd.DataFrame(data)

In [6]:
df

   matnr   name  alter
0    333   hugo     16
1    444  bernd     21
2    555    Bob     45
3   1234  Alice     26

In [8]:
data_false= {
    "matnr": [333, 444, 555, 1234,999],
    "name": ['hugo','bernd','Bob','Alice'],
    "alter": [16, 21, 45, 26]
}

In [13]:
df_addedValue = pd.DataFrame(data_false)
#Ergibt Error
df_addedValue
print('Error')

Hello

In [15]:
df.shape

(4, 3)

Data mit eigenem Index

In [18]:
df_index = pd.DataFrame(data=data, index=["primus", "secundus", "drei", "vier"])
df_index

          matnr   name  alter
primus      333   hugo     16
secundus    444  bernd     21
drei        555    Bob     45
vier       1234  Alice     26

### Daten Typ

In [22]:
# die Größe des df
df.shape

(4, 3)

In [23]:
# Länge des df- Anzahl der Spalten
len(df)

4

In [24]:
#Datentypen
df.dtypes

matnr     int64
name     object
alter     int64
dtype: object